---
kind: method
id: M:Autodesk.Revit.DB.CategoryNameMap.Erase(System.String)
source: html/a5b7531a-a899-2e24-c18c-8b4b372b0b55.htm
---
# Autodesk.Revit.DB.CategoryNameMap.Erase Method

Removes a category with the specified name from the map.

## Syntax (C#)
```csharp
public virtual int Erase(
	string key
)
```

## Parameters
- **key** (`System.String`) - The name of the category to be erased.

## Returns
The number of categories that were erased from the map.